# MEPAnalyticalNode Methods (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
MEPAnalyticalNode Methods
MEPAnalyticalNode Class See Also
---
The MEPAnalyticalNode type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsSameNode | Verify if this node is connected to the other node and thus represents the same analytical node in the network. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# See Also
MEPAnalyticalNode Class
Autodesk.Revit.DB.Analysis Namespace